###############################################################################
# Created by write_sdc
# Mon Mar 21 18:58:18 2022
###############################################################################
current_design mac_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 100.0000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.2500 CLK
set_propagated_clock [get_clocks {CLK}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RST}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[0]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[10]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[11]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[12]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[13]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[14]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[15]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[16]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[17]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[18]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[19]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[1]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[20]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[21]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[22]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[23]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[24]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[25]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[26]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[27]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[28]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[29]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[2]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[30]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[31]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[3]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[4]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[5]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[6]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[7]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[8]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {az[9]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[0]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[10]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[11]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[12]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[13]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[14]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[15]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[1]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[2]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[3]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[4]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[5]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[6]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[7]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[8]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mx[9]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[0]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[10]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[11]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[12]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[13]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[14]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[15]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[1]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[2]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[3]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[4]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[5]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[6]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[7]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[8]}]
set_input_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {my[9]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[0]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[10]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[11]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[12]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[13]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[14]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[15]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[16]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[17]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[18]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[19]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[1]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[20]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[21]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[22]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[23]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[24]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[25]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[26]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[27]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[28]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[29]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[2]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[30]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[31]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[3]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[4]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[5]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[6]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[7]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[8]}]
set_output_delay 20.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {mac[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {mac[31]}]
set_load -pin_load 0.0334 [get_ports {mac[30]}]
set_load -pin_load 0.0334 [get_ports {mac[29]}]
set_load -pin_load 0.0334 [get_ports {mac[28]}]
set_load -pin_load 0.0334 [get_ports {mac[27]}]
set_load -pin_load 0.0334 [get_ports {mac[26]}]
set_load -pin_load 0.0334 [get_ports {mac[25]}]
set_load -pin_load 0.0334 [get_ports {mac[24]}]
set_load -pin_load 0.0334 [get_ports {mac[23]}]
set_load -pin_load 0.0334 [get_ports {mac[22]}]
set_load -pin_load 0.0334 [get_ports {mac[21]}]
set_load -pin_load 0.0334 [get_ports {mac[20]}]
set_load -pin_load 0.0334 [get_ports {mac[19]}]
set_load -pin_load 0.0334 [get_ports {mac[18]}]
set_load -pin_load 0.0334 [get_ports {mac[17]}]
set_load -pin_load 0.0334 [get_ports {mac[16]}]
set_load -pin_load 0.0334 [get_ports {mac[15]}]
set_load -pin_load 0.0334 [get_ports {mac[14]}]
set_load -pin_load 0.0334 [get_ports {mac[13]}]
set_load -pin_load 0.0334 [get_ports {mac[12]}]
set_load -pin_load 0.0334 [get_ports {mac[11]}]
set_load -pin_load 0.0334 [get_ports {mac[10]}]
set_load -pin_load 0.0334 [get_ports {mac[9]}]
set_load -pin_load 0.0334 [get_ports {mac[8]}]
set_load -pin_load 0.0334 [get_ports {mac[7]}]
set_load -pin_load 0.0334 [get_ports {mac[6]}]
set_load -pin_load 0.0334 [get_ports {mac[5]}]
set_load -pin_load 0.0334 [get_ports {mac[4]}]
set_load -pin_load 0.0334 [get_ports {mac[3]}]
set_load -pin_load 0.0334 [get_ports {mac[2]}]
set_load -pin_load 0.0334 [get_ports {mac[1]}]
set_load -pin_load 0.0334 [get_ports {mac[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RST}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {az[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mx[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {my[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
